In [0]:
import pandas as pd
import numpy as np
sdata={'Chia':35000,'Madrid':71000,'Soacha':16000,'Suba':5000}
obj3=pd.Series(sdata)
obj3
municipio=['Salitre','Chia','Soacha','Suba']
obj4=pd.Series(sdata,index=municipio)
obj4
pd.isnull(obj4)
obj3+obj4
obj4.name='poblacion'
obj4.index.name='municipio'
obj4

municipio
Salitre        NaN
Chia       35000.0
Soacha     16000.0
Suba        5000.0
Name: poblacion, dtype: float64

In [0]:
data={'municipio':['Suba','Suba','Suba','Usme','Usme','Usme'],
      'año':[2000,2001,2002,2001,2002,2003],
      'pob':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

  municipio   año  pob
0      Suba  2000  1.5
1      Suba  2001  1.7
2      Suba  2002  3.6
3      Usme  2001  2.4
4      Usme  2002  2.9
5      Usme  2003  3.2

In [0]:
pd.DataFrame(data,columns=['año','municipio','pob'])

    año municipio  pob
0  2000      Suba  1.5
1  2001      Suba  1.7
2  2002      Suba  3.6
3  2001      Usme  2.4
4  2002      Usme  2.9
5  2003      Usme  3.2

In [0]:
fram2=pd.DataFrame(data, columns=['año','municipio','pob','deuda'],index=['uno','dos','tres','cuatro','cinco','seis'])
fram2

         año municipio  pob deuda
uno     2000      Suba  1.5   NaN
dos     2001      Suba  1.7   NaN
tres    2002      Suba  3.6   NaN
cuatro  2001      Usme  2.4   NaN
cinco   2002      Usme  2.9   NaN
seis    2003      Usme  3.2   NaN

In [0]:
valores=pd.Series([-1.2,-1.5,-1.7],index=['dos','cuatro','cinco'])
frame2['deuda']=valores
frame2

    año municipio  pob  deuda
0  2000      Suba  1.5    NaN
1  2001      Suba  1.7    NaN
2  2002      Suba  3.6    NaN
3  2001      Usme  2.4    NaN
4  2002      Usme  2.9    NaN
5  2003      Usme  3.2    NaN

In [0]:
fram2['humedad']=fram2.municipio=='Suba'
fram2

         año municipio  pob deuda  humedad
uno     2000      Suba  1.5   NaN     True
dos     2001      Suba  1.7   NaN     True
tres    2002      Suba  3.6   NaN     True
cuatro  2001      Usme  2.4   NaN    False
cinco   2002      Usme  2.9   NaN    False
seis    2003      Usme  3.2   NaN    False

In [0]:
del fram2['humedad']
fram2.columns

Index(['año', 'municipio', 'pob', 'deuda'], dtype='object')

Diccionarios anidados

In [0]:
poblacion={'Usme':{2001:2.4,2002:2.9},
           'Suba':{2000:1.5,2001:1.7,2002:3.7}}
frame3=pd.DataFrame(poblacion)
frame3

      Usme  Suba
2001   2.4   1.7
2002   2.9   3.7
2000   NaN   1.5

In [0]:
frame3.T

      2001  2002  2000
Usme   2.4   2.9   NaN
Suba   1.7   3.7   1.5

In [0]:
pd.DataFrame(poblacion,index=[2001,2002,2003])
pdata={'Usme':frame3['Usme'][:-1],
       'Suba':frame3['Suba'][:2]}
pdata

{'Suba': 2001    1.7
 2002    3.7
 Name: Suba, dtype: float64, 'Usme': 2001    2.4
 2002    2.9
 Name: Usme, dtype: float64}

In [0]:
frame3.index.name='año';
frame3.columns.name='municipio'
frame3
frame3.values
frame2.values
frame3.columns

Index(['Usme', 'Suba'], dtype='object', name='municipio')

In [0]:
'Usme' in frame3

True

In [0]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj
obj2=obj.reindex(['a','b','c','d','e'])
obje3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3
obj3.reindex(range(6),method='ffill')

TypeError: ignored

In [0]:
frame4=pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a','c','d'],
                    columns=['Ohio','Texas','California'])
frame4

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [0]:
frame5=frame4.reindex(['a','b','c','d'])
frame5
dep=['Texas','Atantico','Ohio']
frame4.reindex(columns=dep)

   Texas  Atantico  Ohio
a      1       NaN     0
c      4       NaN     3
d      7       NaN     6

In [0]:
frame4.loc[['a','b','c','d'],dep]

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Atantico  Ohio
a    1.0       NaN   0.0
b    NaN       NaN   NaN
c    4.0       NaN   3.0
d    7.0       NaN   6.0

In [0]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj=obj.drop('c')
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio','Colorado','Utah','New York'],
                  columns=['one','two','three','four'])
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [0]:
obj=pd.Series(np.aranege(4.))

In [0]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s1
s2
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [0]:
df1=pd.DataFrame(np.arange(9.).res)